PanBabinicz/arm_assembly/share/stm32f446re_rcc.inc
    .equ rcc_cr_pllrdy_position,            (0x19)
    .equ rcc_cr_pllrdy_mask,                (0x01 << rcc_cr_pllrdy_position)
    .equ rcc_cr_pllrdy,                     (rcc_cr_pllrdy_mask)

    .equ rcc_cr_plli2son_position,          (0x1a)
    .equ rcc_cr_plli2son_mask,              (0x01 << rcc_cr_plli2son_position)
    .equ rcc_cr_plli2son,                   (rcc_cr_plli2son_mask)

    .equ rcc_cr_plli2srdy_position,         (0x1b)
    .equ rcc_cr_plli2srdy_mask,             (0x01 << rcc_cr_plli2srdy_position)
    .equ rcc_cr_plli2srdy,                  (rcc_cr_plli2srdy_mask)

    .equ rcc_cr_pllsaion_position,          (0x1c)
    .equ rcc_cr_pllsaion_mask,              (0x01 << rcc_cr_pllsaion_position)
    .equ rcc_cr_pllsaion,                   (rcc_cr_pllsaion_mask)

    .equ rcc_cr_pllsairdy_position,         (0x1d)
    .equ rcc_cr_pllsairdy_mask,             (0x01 << rcc_cr_pllsairdy_position)
    .equ rcc_cr_pllsairdy,                  (rcc_cr_pllsairdy_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC AHB1RST register fields ---------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_ahb1rstr_gpioarst_position,    (0x00)
    .equ rcc_ahb1rstr_gpioarst_mask,        (0x01 << rcc_ahb1rstr_gpioarst_position)
    .equ rcc_ahb1rstr_gpioarst,             (rcc_ahb1rstr_gpioarst_mask)

    .equ rcc_ahb1rstr_gpiobrst_position,    (0x01)
    .equ rcc_ahb1rstr_gpiobrst_mask,        (0x01 << rcc_ahb1rstr_gpiobrst_position)
    .equ rcc_ahb1rstr_gpiobrst,             (rcc_ahb1rstr_gpiobrst_mask)

    .equ rcc_ahb1rstr_gpiocrst_position,    (0x02)
    .equ rcc_ahb1rstr_gpiocrst_mask,        (0x01 << rcc_ahb1rstr_gpiocrst_position)
    .equ rcc_ahb1rstr_gpiocrst,             (rcc_ahb1rstr_gpiocrst_mask)

    .equ rcc_ahb1rstr_gpiodrst_position,    (0x03)
    .equ rcc_ahb1rstr_gpiodrst_mask,        (0x01 << rcc_ahb1rstr_gpiodrst_position)
    .equ rcc_ahb1rstr_gpiodrst,             (rcc_ahb1rstr_gpiodrst_mask)

    .equ rcc_ahb1rstr_gpioerst_position,    (0x04)
    .equ rcc_ahb1rstr_gpioerst_mask,        (0x01 << rcc_ahb1rstr_gpioerst_position)
    .equ rcc_ahb1rstr_gpioerst,             (rcc_ahb1rstr_gpioerst_mask)

    .equ rcc_ahb1rstr_gpiofrst_position,    (0x05)
    .equ rcc_ahb1rstr_gpiofrst_mask,        (0x01 << rcc_ahb1rstr_gpiofrst_position)
    .equ rcc_ahb1rstr_gpiofrst,             (rcc_ahb1rstr_gpiofrst_mask)

    .equ rcc_ahb1rstr_gpiogrst_position,    (0x06)
    .equ rcc_ahb1rstr_gpiogrst_mask,        (0x01 << rcc_ahb1rstr_gpiogrst_position)
    .equ rcc_ahb1rstr_gpiogrst,             (rcc_ahb1rstr_gpiogrst_mask)

    .equ rcc_ahb1rstr_gpiohrst_position,    (0x07)
    .equ rcc_ahb1rstr_gpiohrst_mask,        (0x01 << rcc_ahb1rstr_gpiohrst_position)
    .equ rcc_ahb1rstr_gpiohrst,             (rcc_ahb1rstr_gpiohrst_mask)

    .equ rcc_ahb1rstr_crcrst_position,      (0x0c)
    .equ rcc_ahb1rstr_crcrst_mask,          (0x01 << rcc_ahb1rstr_crcrst_position)
    .equ rcc_ahb1rstr_crcrst,               (rcc_ahb1rstr_crcrst_mask)

    .equ rcc_ahb1rstr_dma1rst_position,     (0x15)
    .equ rcc_ahb1rstr_dma1rst_mask,         (0x01 << rcc_ahb1rstr_dma1rst_position)
    .equ rcc_ahb1rstr_dma1rst,              (rcc_ahb1rstr_dma1rst_mask)

    .equ rcc_ahb1rstr_dma2rst_position,     (0x16)
    .equ rcc_ahb1rstr_dma2rst_mask,         (0x01 << rcc_ahb1rstr_dma2rst_position)
    .equ rcc_ahb1rstr_dma2rst,              (rcc_ahb1rstr_dma2rst_mask)

    .equ rcc_ahb1rstr_otghsrst_position,    (0x1d)
    .equ rcc_ahb1rstr_otghsrst_mask,        (0x01 << rcc_ahb1rstr_otghsrst_position)
    .equ rcc_ahb1rstr_otghsrst,             (rcc_ahb1rstr_otghsrst_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC AHB2RST register fields ---------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_ahb2rstr_dcmirst_position,     (0x00)
    .equ rcc_ahb2rstr_dcmirst_mask,         (0x01 << rcc_ahb2rstr_dcmirst_position)
    .equ rcc_ahb2rstr_dcmirst,              (rcc_ahb2rstr_dcmirst_mask)

    .equ rcc_ahb2rstr_otgfsrst_position,    (0x07)
    .equ rcc_ahb2rstr_otgfsrst_mask,        (0x01 << rcc_ahb2rstr_otgfsrst_position)
    .equ rcc_ahb2rstr_otgfsrst,             (rcc_ahb2rstr_otgfsrst_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC AHB3RST register fields ---------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_ahb3rstr_fmcrst_position,      (0x00)
    .equ rcc_ahb3rstr_fmcrst_mask,          (0x01 << rcc_ahb3rstr_fmcrst_position)
    .equ rcc_ahb3rstr_fmcrst,               (rcc_ahb3rstr_fmcrst_mask)

    .equ rcc_ahb3rstr_qspirst_position,     (0x01)
    .equ rcc_ahb3rstr_qspirst_mask,         (0x01 << rcc_ahb3rstr_qspirst_position)
    .equ rcc_ahb3rstr_qspirst,              (rcc_ahb3rstr_qspirst_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC AHB1EN register fields ----------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_ahb1enr_gpioaen_position,      (0x00)
    .equ rcc_ahb1enr_gpioaen_mask,          (0x01 << rcc_ahb1enr_gpioaen_position)
    .equ rcc_ahb1enr_gpioaen,               (rcc_ahb1enr_gpioaen_mask)

    .equ rcc_ahb1enr_gpioben_position,      (0x01)
    .equ rcc_ahb1enr_gpioben_mask,          (0x01 << rcc_ahb1enr_gpioben_position)
    .equ rcc_ahb1enr_gpioben,               (rcc_ahb1enr_gpioben_mask)

    .equ rcc_ahb1enr_gpiocen_position,      (0x02)
    .equ rcc_ahb1enr_gpiocen_mask,          (0x01 << rcc_ahb1enr_gpiocen_position)
    .equ rcc_ahb1enr_gpiocen,               (rcc_ahb1enr_gpiocen_mask)

    .equ rcc_ahb1enr_gpioden_position,      (0x03)
    .equ rcc_ahb1enr_gpioden_mask,          (0x01 << rcc_ahb1enr_gpioden_position)
    .equ rcc_ahb1enr_gpioden,               (rcc_ahb1enr_gpioden_mask)

    .equ rcc_ahb1enr_gpioeen_position,      (0x04)
    .equ rcc_ahb1enr_gpioeen_mask,          (0x01 << rcc_ahb1enr_gpioeen_position)
    .equ rcc_ahb1enr_gpioeen,               (rcc_ahb1enr_gpioeen_mask)

