PanBabinicz/arm_assembly/share/stm32f446re_rcc.inc
    .equ rcc_apb1rstr_i2c1rst_position,     (0x15)
    .equ rcc_apb1rstr_i2c1rst_mask,         (0x01 << rcc_apb1rstr_i2c1rst_position)
    .equ rcc_apb1rstr_i2c1rst,              (rcc_apb1rstr_i2c1rst_mask)

    .equ rcc_apb1rstr_i2c2rst_position,     (0x16)
    .equ rcc_apb1rstr_i2c2rst_mask,         (0x01 << rcc_apb1rstr_i2c2rst_position)
    .equ rcc_apb1rstr_i2c2rst,              (rcc_apb1rstr_i2c2rst_mask)

    .equ rcc_apb1rstr_i2c3rst_position,     (0x17)
    .equ rcc_apb1rstr_i2c3rst_mask,         (0x01 << rcc_apb1rstr_i2c3rst_position)
    .equ rcc_apb1rstr_i2c3rst,              (rcc_apb1rstr_i2c3rst_mask)

    .equ rcc_apb1rstr_ifmpi2c1rst_position, (0x18)
    .equ rcc_apb1rstr_ifmpi2c1rst_mask,     (0x01 << rcc_apb1rstr_ifmpi2c1rst_position)
    .equ rcc_apb1rstr_ifmpi2c1rst,          (rcc_apb1rstr_ifmpi2c1rst_mask)

    .equ rcc_apb1rstr_can1rst_position,     (0x19)
    .equ rcc_apb1rstr_can1rst_mask,         (0x01 << rcc_apb1rstr_can1rst_position)
    .equ rcc_apb1rstr_can1rst,              (rcc_apb1rstr_can1rst_mask)

    .equ rcc_apb1rstr_can2rst_position,     (0x1a)
    .equ rcc_apb1rstr_can2rst_mask,         (0x01 << rcc_apb1rstr_can2rst_position)
    .equ rcc_apb1rstr_can2rst,              (rcc_apb1rstr_can2rst_mask)

    .equ rcc_apb1rstr_cecrst_position,      (0x1b)
    .equ rcc_apb1rstr_cecrst_mask,          (0x01 << rcc_apb1rstr_cecrst_position)
    .equ rcc_apb1rstr_cecrst,               (rcc_apb1rstr_cecrst_mask)

    .equ rcc_apb1rstr_pwrrst_position,      (0x1c)
    .equ rcc_apb1rstr_pwrrst_mask,          (0x01 << rcc_apb1rstr_pwrrst_position)
    .equ rcc_apb1rstr_pwrrst,               (rcc_apb1rstr_pwrrst_mask)

    .equ rcc_apb1rstr_dacrst_position,      (0x1d)
    .equ rcc_apb1rstr_dacrst_mask,          (0x01 << rcc_apb1rstr_dacrst_position)
    .equ rcc_apb1rstr_dacrst,               (rcc_apb1rstr_dacrst_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC APB2RST register fields ---------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_apb2rstr_tim1rst_position,     (0x00)
    .equ rcc_apb2rstr_tim1rst_mask,         (0x01 << rcc_apb2rstr_tim1rst_position)
    .equ rcc_apb2rstr_tim1rst,              (rcc_apb2rstr_tim1rst_mask)

    .equ rcc_apb2rstr_tim8rst_position,     (0x01)
    .equ rcc_apb2rstr_tim8rst_mask,         (0x01 << rcc_apb2rstr_tim8rst_position)
    .equ rcc_apb2rstr_tim8rst,              (rcc_apb2rstr_tim8rst_mask)

    .equ rcc_apb2rstr_usart1rst_position,   (0x04)
    .equ rcc_apb2rstr_usart1rst_mask,       (0x01 << rcc_apb2rstr_usart1rst_position)
    .equ rcc_apb2rstr_usart1rst,            (rcc_apb2rstr_usart1rst_mask)

    .equ rcc_apb2rstr_usart6rst_position,   (0x05)
    .equ rcc_apb2rstr_usart6rst_mask,       (0x01 << rcc_apb2rstr_usart6rst_position)
    .equ rcc_apb2rstr_usart6rst,            (rcc_apb2rstr_usart6rst_mask)

    .equ rcc_apb2rstr_adcrst_position,      (0x08)
    .equ rcc_apb2rstr_adcrst_mask,          (0x01 << rcc_apb2rstr_adcrst_position)
    .equ rcc_apb2rstr_adcrst,               (rcc_apb2rstr_adcrst_mask)

    .equ rcc_apb2rstr_sdiorst_position,     (0x0b)
    .equ rcc_apb2rstr_sdiorst_mask,         (0x01 << rcc_apb2rstr_sdiorst_position)
    .equ rcc_apb2rstr_sdiorst,              (rcc_apb2rstr_sdiorst_mask)

    .equ rcc_apb2rstr_spi1rst_position,     (0x0c)
    .equ rcc_apb2rstr_spi1rst_mask,         (0x01 << rcc_apb2rstr_spi1rst_position)
    .equ rcc_apb2rstr_spi1rst,              (rcc_apb2rstr_spi1rst_mask)

    .equ rcc_apb2rstr_spi4rst_position,     (0x0d)
    .equ rcc_apb2rstr_spi4rst_mask,         (0x01 << rcc_apb2rstr_spi4rst_position)
    .equ rcc_apb2rstr_spi4rst,              (rcc_apb2rstr_spi4rst_mask)

    .equ rcc_apb2rstr_syscfgrst_position,   (0x0e)
    .equ rcc_apb2rstr_syscfgrst_mask,       (0x01 << rcc_apb2rstr_syscfgrst_position)
    .equ rcc_apb2rstr_syscfgrst,            (rcc_apb2rstr_syscfgrst_mask)

    .equ rcc_apb2rstr_tim9rst_position,     (0x10)
    .equ rcc_apb2rstr_tim9rst_mask,         (0x01 << rcc_apb2rstr_tim9rst_position)
    .equ rcc_apb2rstr_tim9rst,              (rcc_apb2rstr_tim9rst_mask)

    .equ rcc_apb2rstr_tim10rst_position,    (0x11)
    .equ rcc_apb2rstr_tim10rst_mask,        (0x01 << rcc_apb2rstr_tim10rst_position)
    .equ rcc_apb2rstr_tim10rst,             (rcc_apb2rstr_tim10rst_mask)

    .equ rcc_apb2rstr_tim11rst_position,    (0x12)
    .equ rcc_apb2rstr_tim11rst_mask,        (0x01 << rcc_apb2rstr_tim11rst_position)
    .equ rcc_apb2rstr_tim11rst,             (rcc_apb2rstr_tim11rst_mask)

    .equ rcc_apb2rstr_sai1rst_position,     (0x16)
    .equ rcc_apb2rstr_sai1rst_mask,         (0x01 << rcc_apb2rstr_sai1rst_position)
    .equ rcc_apb2rstr_sai1rst,              (rcc_apb2rstr_sai1rst_mask)

    .equ rcc_apb2rstr_sai2rst_position,     (0x17)
    .equ rcc_apb2rstr_sai2rst_mask,         (0x01 << rcc_apb2rstr_sai2rst_position)
    .equ rcc_apb2rstr_sai2rst,              (rcc_apb2rstr_sai2rst_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC APB1EN register fields ----------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_apb1enr_tim2en_position,       (0x00)
    .equ rcc_apb1enr_tim2en_mask,           (0x01 << rcc_apb1enr_tim2en_position)
    .equ rcc_apb1enr_tim2en,                (rcc_apb1enr_tim2en_mask)

    .equ rcc_apb1enr_tim3en_position,       (0x01)
    .equ rcc_apb1enr_tim3en_mask,           (0x01 << rcc_apb1enr_tim3en_position)
    .equ rcc_apb1enr_tim3en,                (rcc_apb1enr_tim3en_mask)

    .equ rcc_apb1enr_tim4en_position,       (0x02)
    .equ rcc_apb1enr_tim4en_mask,           (0x01 << rcc_apb1enr_tim4en_position)
    .equ rcc_apb1enr_tim4en,                (rcc_apb1enr_tim4en_mask)

    .equ rcc_apb1enr_tim5en_position,       (0x03)
    .equ rcc_apb1enr_tim5en_mask,           (0x01 << rcc_apb1enr_tim5en_position)
    .equ rcc_apb1enr_tim5en,                (rcc_apb1enr_tim5en_mask)

    .equ rcc_apb1enr_tim6en_position,       (0x04)
    .equ rcc_apb1enr_tim6en_mask,           (0x01 << rcc_apb1enr_tim6en_position)
    .equ rcc_apb1enr_tim6en,                (rcc_apb1enr_tim6en_mask)

    .equ rcc_apb1enr_tim7en_position,       (0x05)
    .equ rcc_apb1enr_tim7en_mask,           (0x01 << rcc_apb1enr_tim7en_position)
    .equ rcc_apb1enr_tim7en,                (rcc_apb1enr_tim7en_mask)

    .equ rcc_apb1enr_tim12en_position,      (0x06)
    .equ rcc_apb1enr_tim12en_mask,          (0x01 << rcc_apb1enr_tim12en_position)
    .equ rcc_apb1enr_tim12en,               (rcc_apb1enr_tim12en_mask)

    .equ rcc_apb1enr_tim13en_position,      (0x07)
    .equ rcc_apb1enr_tim13en_mask,          (0x01 << rcc_apb1enr_tim13en_position)
    .equ rcc_apb1enr_tim13en,               (rcc_apb1enr_tim13en_mask)

    .equ rcc_apb1enr_tim14en_position,      (0x08)
    .equ rcc_apb1enr_tim14en_mask,          (0x01 << rcc_apb1enr_tim14en_position)
    .equ rcc_apb1enr_tim14en,               (rcc_apb1enr_tim14en_mask)

    .equ rcc_apb1enr_wwdgen_position,       (0x0b)
    .equ rcc_apb1enr_wwdgen_mask,           (0x01 << rcc_apb1enr_wwdgen_position)
    .equ rcc_apb1enr_wwdgen,                (rcc_apb1enr_wwdgen_mask)

    .equ rcc_apb1enr_spi2en_position,       (0x0e)
    .equ rcc_apb1enr_spi2en_mask,           (0x01 << rcc_apb1enr_spi2en_position)
    .equ rcc_apb1enr_spi2en,                (rcc_apb1enr_spi2en_mask)

    .equ rcc_apb1enr_spi3en_position,       (0x0f)
    .equ rcc_apb1enr_spi3en_mask,           (0x01 << rcc_apb1enr_spi3en_position)
    .equ rcc_apb1enr_spi3en,                (rcc_apb1enr_spi3en_mask)

    .equ rcc_apb1enr_spdifrxen_position,    (0x10)
    .equ rcc_apb1enr_spdifrxen_mask,        (0x01 << rcc_apb1enr_spdifrxen_position)
    .equ rcc_apb1enr_spdifrxen,             (rcc_apb1enr_spdifrxen_mask)

