PanBabinicz/arm_assembly/share/stm32f446re_rcc.inc
    .equ rcc_apb1enr_usart2en_position,     (0x11)
    .equ rcc_apb1enr_usart2en_mask,         (0x01 << rcc_apb1enr_usart2en_position)
    .equ rcc_apb1enr_usart2en,              (rcc_apb1enr_usart2en_mask)

    .equ rcc_apb1enr_usart3en_position,     (0x12)
    .equ rcc_apb1enr_usart3en_mask,         (0x01 << rcc_apb1enr_usart3en_position)
    .equ rcc_apb1enr_usart3en,              (rcc_apb1enr_usart3en_mask)

    .equ rcc_apb1enr_usart4en_position,     (0x13)
    .equ rcc_apb1enr_usart4en_mask,         (0x01 << rcc_apb1enr_usart4en_position)
    .equ rcc_apb1enr_usart4en,              (rcc_apb1enr_usart4en_mask)

    .equ rcc_apb1enr_usart5en_position,     (0x14)
    .equ rcc_apb1enr_usart5en_mask,         (0x01 << rcc_apb1enr_usart5en_position)
    .equ rcc_apb1enr_usart5en,              (rcc_apb1enr_usart5en_mask)

    .equ rcc_apb1enr_i2c1en_position,       (0x15)
    .equ rcc_apb1enr_i2c1en_mask,           (0x01 << rcc_apb1enr_i2c1en_position)
    .equ rcc_apb1enr_i2c1en,                (rcc_apb1enr_i2c1en_mask)

    .equ rcc_apb1enr_i2c2en_position,       (0x16)
    .equ rcc_apb1enr_i2c2en_mask,           (0x01 << rcc_apb1enr_i2c2en_position)
    .equ rcc_apb1enr_i2c2en,                (rcc_apb1enr_i2c2en_mask)

    .equ rcc_apb1enr_i2c3en_position,       (0x17)
    .equ rcc_apb1enr_i2c3en_mask,           (0x01 << rcc_apb1enr_i2c3en_position)
    .equ rcc_apb1enr_i2c3en,                (rcc_apb1enr_i2c3en_mask)

    .equ rcc_apb1enr_fmpi2c1en_position,    (0x18)
    .equ rcc_apb1enr_fmpi2c1en_mask,        (0x01 << rcc_apb1enr_fmpi2c1en_position)
    .equ rcc_apb1enr_fmpi2c1en,             (rcc_apb1enr_fmpi2c1en_mask)

    .equ rcc_apb1enr_can1en_position,       (0x19)
    .equ rcc_apb1enr_can1en_mask,           (0x01 << rcc_apb1enr_can1en_position)
    .equ rcc_apb1enr_can1en,                (rcc_apb1enr_can1en_mask)

    .equ rcc_apb1enr_can2en_position,       (0x1a)
    .equ rcc_apb1enr_can2en_mask,           (0x01 << rcc_apb1enr_can2en_position)
    .equ rcc_apb1enr_can2en,                (rcc_apb1enr_can2en_mask)

    .equ rcc_apb1enr_cecen_position,        (0x1b)
    .equ rcc_apb1enr_cecen_mask,            (0x01 << rcc_apb1enr_cecen_position)
    .equ rcc_apb1enr_cecen,                 (rcc_apb1enr_cecen_mask)

    .equ rcc_apb1enr_pwren_position,        (0x1c)
    .equ rcc_apb1enr_pwren_mask,            (0x01 << rcc_apb1enr_pwren_position)
    .equ rcc_apb1enr_pwren,                 (rcc_apb1enr_pwren_mask)

    .equ rcc_apb1enr_dacen_position,        (0x1d)
    .equ rcc_apb1enr_dacen_mask,            (0x01 << rcc_apb1enr_dacen_position)
    .equ rcc_apb1enr_dacen,                 (rcc_apb1enr_dacen_mask)


@-----------------------------------------------------------------------------------------------@
@--------------------------------- RCC APB2EN register fields ----------------------------------@
@-----------------------------------------------------------------------------------------------@

    .equ rcc_apb2enr_tim1en_position,       (0x00)
    .equ rcc_apb2enr_tim1en_mask,           (0x01 << rcc_apb2enr_tim1en_position)
    .equ rcc_apb2enr_tim1en,                (rcc_apb2enr_tim1en_mask)

    .equ rcc_apb2enr_tim8en_position,       (0x01)
    .equ rcc_apb2enr_tim8en_mask,           (0x01 << rcc_apb2enr_tim8en_position)
    .equ rcc_apb2enr_tim8en,                (rcc_apb2enr_tim8en_mask)

    .equ rcc_apb2enr_usart1en_position,     (0x04)
    .equ rcc_apb2enr_usart1en_mask,         (0x01 << rcc_apb2enr_usart1en_position)
    .equ rcc_apb2enr_usart1en,              (rcc_apb2enr_usart1en_mask)

    .equ rcc_apb2enr_usart6en_position,     (0x05)
    .equ rcc_apb2enr_usart6en_mask,         (0x01 << rcc_apb2enr_usart6en_position)
    .equ rcc_apb2enr_usart6en,              (rcc_apb2enr_usart6en_mask)

    .equ rcc_apb2enr_adc1en_position,       (0x08)
    .equ rcc_apb2enr_adc1en_mask,           (0x01 << rcc_apb2enr_adc1en_position)
    .equ rcc_apb2enr_adc1en,                (rcc_apb2enr_adc1en_mask)

    .equ rcc_apb2enr_adc2en_position,       (0x09)
    .equ rcc_apb2enr_adc2en_mask,           (0x01 << rcc_apb2enr_adc2en_position)
    .equ rcc_apb2enr_adc2en,                (rcc_apb2enr_adc2en_mask)

    .equ rcc_apb2enr_adc3en_position,       (0x0a)
    .equ rcc_apb2enr_adc3en_mask,           (0x01 << rcc_apb2enr_adc3en_position)
    .equ rcc_apb2enr_adc3en,                (rcc_apb2enr_adc3en_mask)

    .equ rcc_apb2enr_sdioen_position,       (0x0b)
    .equ rcc_apb2enr_sdioen_mask,           (0x01 << rcc_apb2enr_sdioen_position)
    .equ rcc_apb2enr_sdioen,                (rcc_apb2enr_sdioen_mask)

    .equ rcc_apb2enr_spi1en_position,       (0x0c)
    .equ rcc_apb2enr_spi1en_mask,           (0x01 << rcc_apb2enr_spi1en_position)
    .equ rcc_apb2enr_spi1en,                (rcc_apb2enr_spi1en_mask)

    .equ rcc_apb2enr_spi4en_position,       (0x0d)
    .equ rcc_apb2enr_spi4en_mask,           (0x01 << rcc_apb2enr_spi4en_position)
    .equ rcc_apb2enr_spi4en,                (rcc_apb2enr_spi4en_mask)

    .equ rcc_apb2enr_syscfgen_position,     (0x0e)
    .equ rcc_apb2enr_syscfgen_mask,         (0x01 << rcc_apb2enr_syscfgen_position)
    .equ rcc_apb2enr_syscfgen,              (rcc_apb2enr_syscfgen_mask)

    .equ rcc_apb2enr_tim9en_position,       (0x10)
    .equ rcc_apb2enr_tim9en_mask,           (0x01 << rcc_apb2enr_tim9en_position)
    .equ rcc_apb2enr_tim9en,                (rcc_apb2enr_tim9en_mask)

    .equ rcc_apb2enr_tim10en_position,      (0x11)
    .equ rcc_apb2enr_tim10en_mask,          (0x01 << rcc_apb2enr_tim10en_position)
    .equ rcc_apb2enr_tim10en,               (rcc_apb2enr_tim10en_mask)

    .equ rcc_apb2enr_tim11en_position,      (0x12)
    .equ rcc_apb2enr_tim11en_mask,          (0x01 << rcc_apb2enr_tim11en_position)
    .equ rcc_apb2enr_tim11en,               (rcc_apb2enr_tim11en_mask)

    .equ rcc_apb2enr_sai1en_position,       (0x16)
    .equ rcc_apb2enr_sai1en_mask,           (0x01 << rcc_apb2enr_sai1en_position)
    .equ rcc_apb2enr_sai1en,                (rcc_apb2enr_sai1en_mask)

    .equ rcc_apb2enr_sai2en_position,       (0x17)
    .equ rcc_apb2enr_sai2en_mask,           (0x01 << rcc_apb2enr_sai2en_position)
    .equ rcc_apb2enr_sai2en,                (rcc_apb2enr_sai2en_mask)



    TODO:
    rcc_ahb1enr_gpioaen = 0x01
    rcc_ahb1enr_gpioaen = 0x01

    gpiox_moder_base = 0x40020000
    gpiox_moder_input_5 = 0x0 << 10
    gpiox_moder_output_5 = 0x1 << 10
    gpiox_moder_af_5 = 0x2 << 10
    gpiox_moder_analog_5 = 0x3 << 10

    gpiox_bsrr_base = 0x40020018
    gpiox_bsrr_bs5 = 0x1 << 5
    gpiox_bsrr_br5 = 0x1 << 21


@-----------------------------------------------------------------------------------------------@
